Revit 2024 API
BuiltInFailures.TilePatternTileFailures.TilePatternTile_InvalidFamily Property
 Family not appropriate for Divided Surface component.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TilePatternTile_InvalidFamily { get; }
Visual Basic
Public Shared ReadOnly Property TilePatternTile_InvalidFamily As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TilePatternTile_InvalidFamily {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.TilePatternTileFailures Class
Autodesk.Revit.DB Namespace